search_params = {
    'page1': {
        'searchText': 'сети домашнего текстиля',
        'loc': 'Россия'
    },
    'page2': {
        'searchText': 'спа салоны',
        'loc': 'Россия'
    },
    'page3': {
        'searchText': 'сети домашнего текстиля',
        'loc': 'Россия'
    },
    'page4': {
        'searchText': 'спа салоны',
        'loc': 'Россия'
    },
    'page5': {
        'searchText': 'салон штор',
        'loc': 'Россия'
    },
    'page6': {
        'searchText': 'магазины текстиля',
        'loc': 'Россия'
    },
    'page7': {
        'searchText': 'салон домашнего текстиля',
        'loc': 'Россия'
    },
    'page8': {
        'searchText': 'магазин постельного белья',
        'loc': 'Россия'
    },
    'page9': {
        'searchText': 'ковры интерьер',
        'loc': 'Россия'
    },
    'page10': {
        'searchText': 'производители готового столового текстиля',
        'loc': 'Россия'
    },
    'page11': {
        'searchText': 'производители полотенец',
        'loc': 'Россия'
    },
    'page12': {
        'searchText': 'дистрибьютеры интерьерных тканей',
        'loc': 'Россия'
    },
    # Добавьте остальные страницы поиска по аналогии
}